* Filter out beginnings of simulation time

This is unused code for post-hoc analysis.

#+begin_src python :session :tangle no :results output
# start_ratio = []

# for aid, data in df_interpolated.groupby('aid'):
#   aid_np = data.reset_index(drop = True).drop('aid', axis = 1).to_numpy().astype('float32')

#   unchanged_feature_indices = np.where(np.std(aid_np, axis = 0) == 0)
#   check_np = np.delete(aid_np, unchanged_feature_indices, axis = 1)
#   #print("{} {}".format(aid_np.shape, check_np.shape))

#   start_idx = 0

#   for i in range(1, check_np.shape[0]):
#     if np.not_equal(check_np[0, :], check_np[i, :]).all():
#       start_idx = i
#       break

#   start_ratio.append(start_idx / check_np.shape[0])

# print(sum(start_ratio) / len(start_ratio))
#+end_src

#+RESULTS:
: 0.31286243380268963

